# -*- org-export-with-todo-keywords: nil; org-export-use-babel: t; org-edit-src-content-indentation: 2; org-src-preserve-indentation: nil; org-babel-results-keyword: "results"; org-image-actual-width: 1100; org-make-toc-insert-custom-ids: t; org-pandoc-format-extensions: (markdown_github+pipe_tables+raw_html); -*-
#+PROPERTY: HEADER-ARGS                 :eval never-export
#+PROPERTY: HEADER-ARGS:shell           :shebang /bin/bash :prologue "echo '# OUTPUT:'"
#+PROPERTY: HEADER-ARGS:jupyter-python  :session 20241230--03--5+2ghz--no_load
#+EXPORT_FILE_NAME: report
#+OPTIONS: toc:nil
#+OPTIONS: tags:nil

* SECTION Test summary                                              :noipynb:
  :PROPERTIES:
  :CUSTOM_ID: test-summary
  :END:

*Test group:* =20250210_gh712_peak_jitter= Testing peak jitter calculation.

*Test:* =03--5+2ghz--no_load= 5Ghz and 2Ghz Wi-Fi SSIDs (same AP), no external load.

*Date:*

#+begin_src shell :results drawer :exports results :prologue ""
  date "+%a %d %b %Y"
#+end_src

#+results:
:results:
Thu 13 Feb 2025
:end:

*Artifacts:*

| *name*        | *link*            |
|---------------+-------------------|
| receiver dump | [[file:roc_recv.csv.xz][=roc_recv.csv.xz=]] |
| receiver log  | [[file:roc_recv.log.xz][=roc_recv.log.xz=]] |
| sender log    | [[file:roc_send.log.xz][=roc_send.log.xz=]] |

*Jupyter notebook:*

[[file:report.ipynb][=report.ipynb=]]

** Software info

- *git revisions*

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd roc-toolkit && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit a02a89458df136c7dc7585e1f25a7ae1a722afd3
   : Author: Victor Gaydov <victor@enise.org>
   :
   :     scripts: Fixes in rgh.py

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd csvplotter && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit 76e75481d818663166396b03ccc39687fd0a2d1a
   : Author: Victor Gaydov <victor@enise.org>
   :
   :     Add DepacketizerPlotter

- *roc-toolkit version*

   #+begin_src shell :results verbatim :exports both
     roc-recv --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-recv 0.4.0 (b2798abb92)

   #+begin_src shell :results verbatim :exports both
     ssh orangepi-lite2.lan ./roc/roc-send --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-send 0.4.0 (b2798abb92)

** Precheck

- *ping*

   #+begin_src shell :results verbatim :exports both
     ping -q -i 0.002 -c 1000 orangepi-lite2.lan
   #+end_src

   #+results:
   : # OUTPUT:
   : PING orangepi-lite2.lan (192.168.0.140) 56(84) bytes of data.
   : 
   : --- orangepi-lite2.lan ping statistics ---
   : 1000 packets transmitted, 1000 received, 0% packet loss, time 8560ms
   : rtt min/avg/max/mdev = 1.526/12.463/139.719/13.985 ms, pipe 14

* SECTION Library code
  :PROPERTIES:
  :CUSTOM_ID: library-code
  :END:

#+begin_export markdown
<details>
  <summary>Click to expand</summary>
#+end_export

#+transclude: [[file:../library.py]]  :src jupyter-python :rest ":results none"

#+begin_export markdown
</details>
#+end_export

#+begin_src jupyter-python :exports both
  data = load_csv('roc_recv.csv')
  data.keys()
#+end_src

#+results:
: dict_keys(['m', 'd', 't', 'f'])

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('jitter', data['m'][:,2]),
                stats_table('peak-jitter', data['m'][:,3]/1e6))
#+end_src

#+results:
|       | *jitter*   | *peak-jitter* |
|-------+------------+---------------|
| *min* | 2.738 ms   | 20.524 ms     |
| *max* | 421.824 ms | 421.815 ms    |
| *avg* | 6.896 ms   | 303.091 ms    |
| *p95* | 16.258 ms  | 421.815 ms    |

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('niq-latency', data['t'][:,1]/44100*1e3),
                stats_table('target-latency', data['t'][:,2]/44100*1e3))
#+end_src

#+results:
|       | *niq-latency* | *target-latency* |
|-------+---------------+------------------|
| *min* | -52.517 ms    | 172.880 ms       |
| *max* | 774.082 ms    | 743.764 ms       |
| *avg* | 515.156 ms    | 526.672 ms       |
| *p95* | 757.891 ms    | 743.764 ms       |

